export class SupplierInfoModel {
  id: string;
  name: string;
  inn: string;
  kpp?: string;
  description?: string;
}

export const TEMPORARY_SUPPLIER_LIST = [
  {
    id: '1',
    name: 'ООО Продукты питания',
    inn: '1234567890',
    kpp: '123456789',
    description: 'Описание организации ООО Продукты питания'
  }, {
    id: '2',
    name: 'ИП Святославов Иван Орлович',
    inn: '123456789012',
    description: 'Описание организации ИП Святославов Иван Орлович'
  }, {
    id: '3',
    name: 'ООО Работа высокой этики',
    inn: '1234567891',
    kpp: '123456789',
    description: 'Описание организации ООО Работа высокой этики'
  }, {
    id: '4',
    name: 'ООО Альфа',
    inn: '1234567892',
    kpp: '123456789',
    description: 'Описание организации ООО Альфа'
  }, {
    id: '5',
    name: 'ООО Бетта',
    inn: '1234567893',
    kpp: '123456789',
  }, {
    id: '6',
    name: 'ООО Гамма',
    inn: '1234567894',
    kpp: '123456789',
    description: 'Описание организации ООО Гамма'
  }, {
    id: '7',
    name: 'ООО Эпсилом',
    inn: '1234567895',
    kpp: '123456789',
    description: 'Описание организации ООО Эпсилом'
  }, {
    id: '8',
    name: 'ООО Сердце',
    inn: '1234567896',
    kpp: '123456789',
    description: 'Описание организации ООО Сердце'
  }
];
